In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(":memory:")
cur = con.cursor()

In [3]:
sql_salaries = '''
drop table if exists salaries;
create table salaries (emp_id integer, depname varchar(20), emp varchar(20), role varchar(20), salary integer);
insert into salaries (emp_id, depname, emp,role, salary) values (1, 'dep1','Christiano','Manager', 1000);
insert into salaries (emp_id, depname, emp,role, salary) values (2, 'dep1','Eric','Manager', 1500);
insert into salaries (emp_id, depname, emp,role, salary) values (3, 'dep1','Ryan','Director', 2000);
insert into salaries (emp_id, depname, emp,role, salary) values (4, 'dep1', 'Bryan','Director',1500);
insert into salaries (emp_id, depname, emp,role, salary) values (5, 'dep2', 'Doreen','Manager',2000);
insert into salaries (emp_id, depname, emp,role, salary) values (6, 'dep2', 'Gabriel','Manager',3000);
insert into salaries (emp_id, depname, emp,role, salary) values (7, 'dep2', 'Angel','Director',2400);
insert into salaries (emp_id, depname, emp,role, salary) values (8, 'dep2', 'Robin','Director',2700);
insert into salaries (emp_id, depname, emp,role, salary) values (9, 'dep3','Sarah','Manager', 1900);
insert into salaries (emp_id, depname, emp,role, salary) values (10, 'dep3', 'Peter','Manager',1700);
'''

In [ ]:
sql_salaries = '''
drop table if exists salaries1;
create table salaries1 (emp_id integer, depname varchar(20), emp varchar(20), role varchar(20), salary integer);
insert into salaries1 (emp_id, depname, emp,role, salary) values (1, 'dep1','Christiano','Manager', 1000);
insert into salaries1 (emp_id, depname, emp,role, salary) values (2, 'dep1','Eric','Manager', 1500);
insert into salaries1 (emp_id, depname, emp,role, salary) values (3, 'dep1','Ryan','Director', 2000);
insert into salaries1 (emp_id, depname, emp,role, salary) values (4, 'dep1', 'Bryan','Director',1500);
insert into salaries1 (emp_id, depname, emp,role, salary) values (5, 'dep2', 'Doreen','Manager',2000);
insert into salaries1 (emp_id, depname, emp,role, salary) values (6, 'dep2', 'Gabriel','Manager',3000);
insert into salaries1 (emp_id, depname, emp,role, salary) values (7, 'dep2', 'Angel','Manager',2400);
insert into salaries1 (emp_id, depname, emp,role, salary) values (8, 'dep2', 'Robin','Director',2700);
insert into salaries1 (emp_id, depname, emp,role, salary) values (9, 'dep3','Sarah','Manager', 1900);
insert into salaries1 (emp_id, depname, emp,role, salary) values (10, 'dep3', 'Peter','Manager',1700);
'''

In [4]:
cur.executescript(sql_salaries)
con.commit()

In [ ]:
pd.read_sql(
    """
SELECT *
FROM salaries
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT avg(salary) as 'avg'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary, avg(salary) OVER () as 'avg'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary, abs(salary - avg(salary) OVER ()) as 'diff_with_avg'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary, avg(salary) OVER (PARTITION BY depname) as 'avg_by_dept'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary, abs(salary - avg(salary) OVER (PARTITION BY depname))  as 'diff_with_avg_by_dept'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary, sum(salary) OVER () as 'sum'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary, salary*100/(sum(salary) OVER ()) as 'prc'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary, round(salary*100/(sum(salary) OVER ()),1) as 'prc'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary, cast(salary*100/(sum(salary) OVER ()) as float) as 'prc'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary, round(cast(salary as float)*100/(sum(salary) OVER ()),2) as 'prc'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary, round(salary*100/cast(sum(salary) OVER () as float),2) as 'prc'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary, round(salary*100.0/(sum(salary) OVER ()),2) as 'prc'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary, round(salary*1.0/(sum(salary) OVER ()),2) as 'prc'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT 1/2
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT 1.0/2
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT 1/2.0
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary, sum(salary) OVER (PARTITION BY depname) as 'sum'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary, sum(salary) OVER (PARTITION BY depname ORDER BY salary) as 'sum'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id,emp, depname, salary,
sum(salary) OVER (PARTITION BY depname ORDER BY salary ROWS BETWEEN CURRENT ROW AND 1 FOLLOWING) as 'sum'
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id, emp,depname, salary, row_number() OVER (PARTITION BY depname) row_num_by_dept
FROM salaries;
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id, emp,depname, salary, row_number() OVER (PARTITION BY depname ORDER BY salary DESC) row_num_by_dept
FROM salaries
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id, emp,depname, salary, rank() OVER (PARTITION BY depname ORDER BY salary DESC) rank_by_dept
FROM salaries
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id, emp,depname, salary, dense_rank() OVER (PARTITION BY depname ORDER BY salary DESC) rank_by_dept
FROM salaries
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
select * from (
SELECT emp_id, emp,depname, salary, row_number() OVER (PARTITION BY depname ORDER BY salary DESC) row_num_by_dept
FROM salaries
) r where r.row_num_by_dept = 1
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
with ranks as (
SELECT emp_id, emp,depname, salary,
row_number() OVER (PARTITION BY depname ORDER BY salary DESC) row_num_by_dept
FROM salaries
) 
select * from ranks where row_num_by_dept = 1
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
with ranks as (
SELECT emp_id, emp,depname, salary,
row_number() OVER (PARTITION BY depname ORDER BY salary DESC) row_num_by_dept
FROM salaries
) 
select * from ranks where row_num_by_dept = 1
union all
select * from ranks where row_num_by_dept = 2
union all
select * from ranks where row_num_by_dept = 3
    """,
    con,
)

In [6]:
pd.read_sql(
    """
SELECT emp_id, emp,depname, salary,NTILE(5) OVER(ORDER BY salary DESC) AS 'NTILE' 
FROM salaries
    """,
    con,
)

   emp_id         emp depname  salary  NTILE
0       6     Gabriel    dep2    3000      1
1       8       Robin    dep2    2700      1
2       7       Angel    dep2    2400      2
3       3        Ryan    dep1    2000      2
4       5      Doreen    dep2    2000      3
5       9       Sarah    dep3    1900      3
6      10       Peter    dep3    1700      4
7       2        Eric    dep1    1500      4
8       4       Bryan    dep1    1500      5
9       1  Christiano    dep1    1000      5

In [ ]:
pd.read_sql(
    """
SELECT emp_id, emp,depname, salary,LAG(salary) OVER(PARTITION BY depname ORDER BY salary DESC) AS 'LAG' 
FROM salaries
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id, emp,depname, salary,LEAD(salary) OVER(PARTITION BY depname ORDER BY salary DESC) AS 'LEAD' 
FROM salaries
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id, emp,depname, salary,FIRST_VALUE(salary) OVER(PARTITION BY depname) AS 'FIRST_VALUE' 
FROM salaries
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id, emp,depname, salary,LAST_VALUE(salary) OVER(PARTITION BY depname) AS 'LAST_VALUE' 
FROM salaries
    """,
    con,
)

In [ ]:
pd.read_sql(
    """
SELECT emp_id, emp,depname, salary,LAST_VALUE(salary) OVER(PARTITION BY depname ORDER BY salary) AS 'LAST_VALUE' 
FROM salaries
    """,
    con,
)

In [5]:
pd.read_sql(
    """
SELECT emp_id, emp,depname, salary,LAST_VALUE(salary) OVER(PARTITION BY depname ORDER BY salary
ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING
) AS 'LAST_VALUE' 
FROM salaries
    """,
    con,
)

   emp_id         emp depname  salary  LAST_VALUE
0       1  Christiano    dep1    1000        2000
1       2        Eric    dep1    1500        2000
2       4       Bryan    dep1    1500        2000
3       3        Ryan    dep1    2000        2000
4       5      Doreen    dep2    2000        3000
5       7       Angel    dep2    2400        3000
6       8       Robin    dep2    2700        3000
7       6     Gabriel    dep2    3000        3000
8      10       Peter    dep3    1700        1900
9       9       Sarah    dep3    1900        1900

1. Какую часть зарплат от общей суммы получают менеждеры, а какую директора?

2. На каком месте по величине зарплаты находятся сотрудники, у которых первая буква в имени "R"?

3. Выведите процент менеджеров и директоров по каждому из департаментов.

4. Выведите среднюю зарплату по 1 департаменту, а также по 2 и 3 совместно.

5. Какой процент от суммы зарплат по всех организации получают 10% сотрудников с самыми большими зарплатами? 20%?30%?